app/Controllers/AgentController.php

SELECT `FirstName`, `MiddleName`, `LastName`, `Address`, `ContactNumber`, `Role`
FROM `users`
WHERE `Role` = 3
---
    public function agentData()
    {
        $data = $this->userAccounts
        ->select('UserId, FirstName, MiddleName, LastName, Address, ContactNumber, Role')
        ->where('Role', 3)
        ->findAll();