app/Controllers/ChatController.php

SELECT `Email`, `Role`
FROM `users`
WHERE `Role` = 2
---
    public function getAdminProfiles()
    {
        $data = $this->userAccounts
        ->select('Email, Role')
        ->where('Role', 2)
        ->findAll();

SELECT `Email`, `Role`
FROM `users`
WHERE `Role` = 3
---
    public function getAgentProfiles()
    {
        $data = $this->userAccounts
        ->select('Email, Role')
        ->where('Role', 3)
        ->findAll();

SELECT `realtimechat`.`ChatId`, `realtimechat`.`UserId`, `realtimechat`.`Message`, `users`.`UserId`, `users`.`Email`, `users`.`Role`
FROM `realtimechat`
JOIN `users` ON `realtimechat`.`UserId` = `users`.`UserId`
WHERE `users`.`Role` = 'Admin'
---
    public function getmessageAdmin()
{
    $data = $this->chat
        ->select('realtimechat.ChatId, realtimechat.UserId, realtimechat.Message, users.UserId,users.Email, users.Role') // Removed the extra comma at the end
        ->join('users', 'realtimechat.UserId = users.UserId')
        ->where('users.Role', 'Admin') // Added single quotes around 'PlanHolder'
        ->findAll();

SELECT `realtimechat`.`ChatId`, `realtimechat`.`UserId`, `realtimechat`.`Message`, `users`.`UserId`, `users`.`Email`, `users`.`Role`
FROM `realtimechat`
JOIN `users` ON `realtimechat`.`UserId` = `users`.`UserId`
WHERE `users`.`Role` = 'PlanHolder'
---
public function getmessagePlanHolder()
{
    $data = $this->chat
    ->select('realtimechat.ChatId, realtimechat.UserId, realtimechat.Message, users.UserId,users.Email, users.Role') // Removed the extra comma at the end
    ->join('users', 'realtimechat.UserId = users.UserId')
    ->where('users.Role', 'PlanHolder') // Added single quotes around 'PlanHolder'
    ->findAll();