app/Controllers/Dashboard.php

SELECT `Address`
FROM `users`
WHERE `Address` = 'Puerto Galera, Oriental Mindoro'
AND `Role` = 'PlanHolder'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `Address` = 'Puerto Galera, Oriental Mindoro'
---
    public function totallocationpercentage()
    {
        $addresses = ['Puerto Galera, Oriental Mindoro', 'Baco, Oriental Mindoro', 'Calapan City, Oriental Mindoro', 'San Teodoro, Oriental Mindoro', 'Naujan, Oriental Mindoro'];

        $addressPercentages = [];

        foreach ($addresses as $address) {
            $data = $this->userAccounts
                ->select('Address')
                ->where('Address', $address)
                ->where('Role', 'PlanHolder')
                ->findAll();

            $totalRecords = $this->userAccounts
                ->where('Address', $address)
                ->countAllResults();