app/Controllers/FeedbackController.php

    public function getNotifications()
    {
        $data = $this->feedbackModel->findAll();
---
SELECT *
FROM `feedback`