app/Controllers/UserController.php

    public function registerData()
    {
        $data = $this->userAccounts
        ->select('UserId, FirstName, MiddleName, LastName, Address, ContactNumber, Role')
        ->where('Role', 1)
        ->findAll();
---
SELECT `UserId`, `FirstName`, `MiddleName`, `LastName`, `Address`, `ContactNumber`, `Role`
FROM `users`
WHERE `Role` = 1

    public function register()
    {
        helper(['form']);
        $rules = [
            'FirstName' => ['rules' => 'required|max_length[255]'],
            'MiddleName' => ['rules' => 'max_length[255]'],
            'LastName' => ['rules' => 'required|max_length[255]'],
            'Email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email'],
            'Password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'Address' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'ContactNumber' => ['rules' => 'required|max_length[11]'],
            'confirmPassword' => ['rules' => 'required|matches[Password]']
        ];
        if ($this->validate($rules)) {
            $json = $this->request->getJSON();
            $data = [
                "FirstName" => $json->FirstName,
                "MiddleName" => $json->MiddleName,
                "LastName" => $json->LastName,
                "Email" => $json->Email,
                "Password" => password_hash($json->Password, PASSWORD_DEFAULT),
                "Address" => $json->Address,
                "ContactNumber" => $json->ContactNumber,
                'Role' => 'PlanHolder'
            ];

            $this->userAccounts->save($data);
---
INSERT INTO `users` (`FirstName`, `MiddleName`, `LastName`, `Email`, `Password`, `Address`, `ContactNumber`, `Role`) VALUES ('Agent', 'Agent', 'Agent', 'Agent@gmail.com', '$2y$10$Ghh10g2SDQW9TrVrmUaqBOGiSwqlzFYPBbgWm3/YUoYusqlAtuvEq', 'Puerto Galera, Oriental Mindoro', '09995368233', 'PlanHolder')

    public function loginAuth()
    {
        $json = $this->request->getJSON();

        $Email = $json->Email;
        $Password = $json->Password;

        $user = $this->userAccounts->where('Email', $Email)->first();
---
SELECT *
FROM `users`
WHERE `Email` = 'galicharian09@gmail.com'
 LIMIT 1